{
  "_name_or_path": "hf_models_fb/s2t-small-librispeech-asr",
  "activation_dropout": 0.1,
  "activation_function": "relu",
  "architectures": [
    "Speech2TextForConditionalGeneration"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": 0.0,
  "conv_channels": 1024,
  "conv_kernel_sizes": [
    5,
    5
  ],
  "d_model": 256,
  "decoder_attention_heads": 4,
  "decoder_ffn_dim": 2048,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "decoder_start_token_id": 2,
  "dropout": 0.1,
  "early_stopping": true,
  "encoder_attention_heads": 4,
  "encoder_ffn_dim": 2048,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 12,
  "eos_token_id": 2,
  "gradient_checkpointing": false,
  "init_std": 0.02,
  "input_channels": 1,
  "input_feat_per_channel": 80,
  "is_encoder_decoder": true,
  "max_length": 200,
  "max_source_positions": 6000,
  "max_target_positions": 1024,
  "model_type": "speech_to_text",
  "num_beams": 5,
  "num_conv_layers": 2,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "scale_embedding": true,
  "transformers_version": "4.4.0.dev0",
  "use_cache": true,
  "vocab_size": 10000
}
